IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
*> This is a free format comment
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-GREETING PIC X(20) VALUE 'HELLO FREE WORLD'.
01 WS-COUNT    PIC 9(4)  VALUE 100.

PROCEDURE DIVISION.
MAIN-PARA.
    DISPLAY WS-GREETING.
    ADD 1 TO WS-COUNT.
    IF WS-COUNT > 500
        DISPLAY "BIG COUNT"
    END-IF.
    STOP RUN.
